content.org
#+hugo_base_dir: .
#+hugo_section: posts
#+hugo_auto_set_lastmod: t

* About Me
:PROPERTIES:
:EXPORT_HUGO_SECTION: pages
:EXPORT_FILE_NAME: about
:END:
** Caleb Christensen.
I am a *Revenue Operations professional* who bridges the gap between sales strategy and technical execution.

My approach to operations is rooted in a simple philosophy: *systems should empower the individual, not hinder them.* I spent years on the front lines—from closing deals as a Commercial Loan Officer to architecting Go-to-Market divisions that scaled monthly revenue from $100k to over $350k.

I know firsthand that a "perfect" process fails if it ignores the human reality of the seller.

Unlike traditional analysts, I bring an engineer's toolkit to revenue problems.

Whether I’m automating lead distribution workflows or designing rigorous performance management frameworks in spreadsheets, I build transparent, scalable engines that drive growth.

I am currently seeking a Revenue Operations role where I can apply systems thinking to build the infrastructure of trust and efficiency.

#+begin_export html
<div style="text-align: center;">
  <a href="/" class="btn">RETURN TO HOME</a>
</div>
#+end_export

